.config/settings.org
#+TITLE: Emacs Settings

This is my Emacs settings file.

* about this file
*need to rewrite this*
This Dropbox setup should support both Emacs 25 and 26. Upon fresh installation, modify (on Linux) the .desktop file located in /usr/share/applications. This can be found with:

#+BEGIN_SRC bash
ls /usr/share/applications | grep emacs
#+END_SRC

pThen edit the file as superuser and change the "Exec" line so that running Emacs will execute the command:

#+BEGIN_SRC bash
emacs -q --load "../.config/init.el"
#+END_SRC

OR - just put the previous line as the first line in the .emacs file.

This loads the Dropbox init.el file before establishing the default value of user-emacs-directory.

The following additional packages are required and can be downloaded using "M-x package-install":    
- soothe-theme
- company
- helm
- org
- org-bullets
- org-journal
- org-mind-map
- smartparens
- visual-fill-column

* appearance
#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
;(set-face-attribute 'default nil :height 150) ;; 130 = 13pt font
(add-hook 'dired-mode-hook 'dired-hide-details-mode)
(toggle-frame-fullscreen)
#+END_SRC

Set the soothe-theme as my theme. Also tweak the org-hide face because I don't like how it is visible by default. 
#+BEGIN_SRC emacs-lisp
;;(setq custom-safe-themes
  ;;    (quote       ("a77ced882e25028e994d168a612c763a4feb8c4ab67c5ff48688654d0264370c" default)))
(setq custom-theme-directory user-emacs-directory)
(setq custom-safe-themes
   (quote
    ("10a31b6c251640d04b2fa74bd2c05aaaee915cbca6501bcc82820cdc177f5a93" "2f4f50d98073c01038b518066840638455657dc91dd1a225286d573926f36914" "a77ced882e25028e994d168a612c763a4feb8c4ab67c5ff48688654d0264370c" "5ac259a7a0a0d2b541199480c58510b4f9f244e810da999d3f22d5e3bb0ad208" "fd3b1531faea72f67620800a332e790f9f67b04412ef335c396971fc73bee24b" "06589250ab29513fe389b36799d709686ace3598ff24987e8ecc89e529470fa5" default)))
;;   (quote
;;    ("06589250ab29513fe389b36799d709686ace3598ff24987e8ecc89e529470fa5" "2f4f50d98073c01038b518066840638455657dc91dd1a225286d573926f36914" "10a31b6c251640d04b2fa74bd2c05aaaee915cbca6501bcc82820cdc177f5a93" "a77ced882e25028e994d168a612c763a4feb8c4ab67c5ff48688654d0264370c" default)))
;(load-theme 'soothe)
(load-theme 'northcode)
;(custom-set-faces
; '(org-hide ((t (:background "#110F13" :foreground "#110F13"))))
					;'(font-lock-comment-face ((t (:background "#110F13" :foreground "#7868B5" :slant italic))))
; )

#+END_SRC

Add the time and date to the mode line at the bottom. 
#+BEGIN_SRC emacs-lisp
(setq display-time-day-and-date t)
(display-time-mode t)
#+END_SRC

Show the column number in addition to the line number in the mode line at the bottom.    
#+BEGIN_SRC emacs-lisp
(column-number-mode t)

#+END_SRC
** COMMENT windows appearance
#+begin_src emacs-lisp
(if (string-equal system-type "windows-nt")
(progn (make-frame '((undecorated . t)))
(add-to-list 'default-frame-alist '(drag-internal-border . 1))
(add-to-list 'default-frame-alist '(internal-border-width . 5))
(delete-frame)
))
#+end_src

* autocomplete
Autocomplete stuff. I think ido is only for C-x b. Company is in-buffer autocomplete  
#+BEGIN_SRC emacs-lisp
(require 'company)
(global-company-mode t)
(require 'ido)
(ido-mode t)
#+END_SRC

** spell checking
#+BEGIN_SRC emacs-lisp
(setq ispell-program-name "/usr/bin/aspell")
(add-hook 'org-mode-hook 'flyspell-mode)
#+END_SRC

** javascript
got this from [[https://emacs.cafe/emacs/javascript/setup/2017/05/09/emacs-setup-javascript-2.html]]
#+begin_src emacs-lisp
(require 'js2-mode)
(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))

;; Better imenu
(add-hook 'js2-mode-hook #'js2-imenu-extras-mode)
(add-hook 'js2-mode-hook (lambda () (tern-mode t)))

(require 'company)
(require 'company-tern)

(add-to-list 'company-backends 'company-tern)
(add-hook 'js2-mode-hook (lambda ()
                           (tern-mode)
                           (company-mode)))
                           
;; Disable completion keybindings, as we use xref-js2 instead
(define-key tern-mode-keymap (kbd "M-.") nil)
(define-key tern-mode-keymap (kbd "M-,") nil)
#+end_src
* backups
Backup files locally instead of creating those stupid backup files where each file is.  
#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist '(("." . "~/.emacs.d/backup")))
;;(setq backup-directory-alist '(("." . (concat user-emacs-directory "backup"))))
#+END_SRC

* bookmarks
Add a shortcut for bookmarks. 
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c b") 'bookmark-jump)
(setq bookmark-default-file (concat os-directory "bookmarks"))
#+END_SRC
* personal dictionary
Set the location of the dictionary to the same as the init file. 
#+BEGIN_SRC emacs-lisp
(setq ispell-personal-dictionary (expand-file-name ".ispell_pdict" (file-name-directory user-init-file)))
#+END_SRC
* helm
full-featured command completion and other stuff.     
#+BEGIN_SRC emacs-lisp 
(require 'helm)
(helm-mode t)
(global-set-key (kbd "M-x") 'helm-M-x)
(global-set-key (kbd "C-x C-f") 'helm-find-files)
(global-set-key (kbd "C-x C-b") 'helm-buffers-list)
#+END_SRC
   
* initial buffer
This sets the first buffer as the scratch buffer
#+BEGIN_SRC emacs-lisp
(setq initial-buffer-choice t)
#+END_SRC
* movement keys
#+BEGIN_SRC emacs-lisp 
(require 'dired)
(define-key dired-mode-map (kbd "C-<up>") 'dired-up-directory)
;;(global-set-key (kbd "s-r") 'beginning-of-line)
;;(global-set-key (kbd "C-f") 'forward-word)
;;(global-set-key (kbd "C-b") 'backward-word)
;;(global-set-key (kbd "M-f") 'sp-forward-sexp)
;;(global-set-key (kbd "M-b") 'sp-backward-sexp)
;;(global-set-key (kbd "M-p") 'sp-up-sexp)
;;(global-set-key (kbd "M-n") 'sp-down-sexp)
;;(global-set-key (kbd "M-P") 'sp-backward-up-sexp)
;;(global-set-key (kbd "M-N") 'sp-backward-down-sexp)
#+END_SRC

* my commands
shortcut to my commands that have the "my-" prefix. I don't really use this naming anymore 
#+BEGIN_SRC emacs-lisp
(defun my-commands () (interactive)
       (setq unread-command-events (listify-key-sequence "my-"))
       (call-interactively 'helm-M-x))
(global-set-key (kbd "M-X") 'my-commands)
#+END_SRC

** COMMENT transparency
Set the transparency from 0-9 with C-c t
#+BEGIN_SRC emacs-lisp
(defun my-transparency () (interactive)
       (let ((b (- (read-key "Set transparency value [0-9]") 48)))
	 (if (< b 10) (set-frame-parameter (selected-frame) 'alpha (- 100 (* b 4))))))
(set-frame-parameter (selected-frame) 'alpha 100)
(global-set-key (kbd "C-c t") 'my-transparency)
#+END_SRC

** comment/uncomment
Change the functionality of C-c ; to work on regions also. 
#+BEGIN_SRC emacs-lisp
(defun my-comment-or-uncomment () (interactive)
       (if (region-active-p)
	   (call-interactively 'comment-or-uncomment-region)
	 (comment-or-uncomment-region (point-at-bol) (point-at-eol))))
(global-set-key (kbd "C-c ;") 'my-comment-or-uncomment)
#+END_SRC


