.config/settings.org
** org time heading
:OLD:
#+BEGIN_SRC
(require 'org-journal)
(define-key org-journal-mode-map (kbd "C-c s") 'org-edit-headline)
(define-key org-journal-mode-map (kbd "C-c C-<return>") 'insert-journal-entry)
(define-key org-journal-mode-map (kbd "C-c RET") 'insert-timestamp)

(defun insert-journal-entry () "Insert timestamp with new journal entry headline" (interactive)
       (org-return)
       (set-mark (point))
       (sp-backward-whitespace)
       (org-delete-backward-char 1)
       (org-return)
       (org-return)
       (insert "** \n")
       (insert-timestamp))

(defun insert-timestamp () "Insert current date and time inactive timestamp" (interactive)
       (org-time-stamp-inactive '(16))
       (org-return))
#+END_SRC
:END:

#+BEGIN_SRC emacs-lisp
(require 'org-journal)
(defun insert-time () "Insert the current 24h time in HH:MM format" (interactive)
      (let ((arr (split-string (current-time-string) ":")))
	 (insert (concat (substring (first arr) -2) ":" (nth 1 arr)))))
(defun insert-time-heading () "Insert time as new org heading" (interactive)
       (org-insert-heading-respect-content)
       (insert-time)
       (org-beginning-of-line)
       (set-mark (point))
       (sp-backward-whitespace)
       (org-delete-backward-char 1)
       (org-return)
       (org-return)
       (org-end-of-line)
       (org-return))
(define-key org-mode-map (kbd "C-c RET") 'insert-time-heading)
#+END_SRC

** COMMENT org sort priority
Sort the org headings in the current file by priority. 
#+begin_src emacs-lisp
(define-key org-mode-map (kbd "C-c s") (lambda () (interactive) (beginning-of-buffer) (setq unread-command-events (listify-key-sequence "p")) (org-sort) (org-shifttab)))
#+end_src
** org journal filename
This is a wrapper function to use with the org-capture template so I can capture my TODO items in my latest journal. 
#+begin_src emacs-lisp
(defun org-journal-new-entry-filename () (interactive)
       (call-interactively 'org-journal-new-entry)
       (previous-line)
       (beginning-of-line)
       (kill-line)
       (kill-line)
       (buffer-file-name)
       )
#+end_src
** pdict-add
#+BEGIN_SRC emacs-lisp
(defun pdict-add () "Add current word to dictionary" (interactive)
	 (setq unread-command-events (listify-key-sequence "iy"))
	 (if (not (flyspell-check-previous-highlighted-word))
	     (setq unread-command-events (listify-key-sequence ""))))
;(define-key org-mode-map (kbd "C-c d") 'pdict-add)
#+END_SRC

** minimap
#+begin_src emacs-lisp
(global-set-key (kbd "C-c m") 'minimap-mode)
(setq unread-command-events (listify-key-sequence "\C-cm"))
#+end_src

* org
Save a link to the current place in an org file so that it can be used later with C-c C-l
#+BEGIN_SRC emacs-lisp
(require 'org)

(setq org-return-follows-link t)
(global-set-key (kbd "C-c l") 'org-store-link)
#+END_SRC

*** indentation
#+BEGIN_SRC emacs-lisp 
(define-key org-journal-mode-map (kbd "C-c <right>") 'insert-time-heading-demote)
(define-key org-journal-mode-map (kbd "C-c <left>") 'insert-time-heading-promote)

(defun insert-time-heading-demote () "" (interactive)
       (insert-time-heading)
       (org-demote-subtree))

(defun insert-time-heading-promote () "" (interactive)
       (insert-time-heading)
       (org-promote-subtree))
#+END_SRC
*** capture
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c c") 'org-capture)
(setq org-directory (concat home-directory "/Dropbox/org"))
#+END_SRC
I LEARNED WHAT `BACKQUOTE IS. 
#+begin_src emacs-lisp
(setq org-capture-templates
      (backquote
       (("e" "erik" entry
	 (file
	  ,(concat home-directory "/Dropbox/org/erik.org"))
	 "* TODO %?")
	("m" "MISC" entry
	 (file
	  ,(concat home-directory "/Dropbox/org/misc.org"))
	 "* TODO %?")
	("f" "FILEMAKER" entry
	 (file
	  ,(concat home-directory "/Dropbox/org/filemaker.org"))
	 "* TODO %?")
	("p" "CONTROLLER" entry
	 (file
	  ,(concat home-directory "/Dropbox/org/controller.org"))
	 "* TODO %?")
	("c" "CASCADE" entry
	 (file
	  ,(concat home-directory "/Dropbox/org/cascade.org"))
	 "* TODO %?")
	("i" "IT" entry
	 (file
	  ,(concat home-directory "/Dropbox/org/it.org"))
	 "* TODO %?"))))
#+end_src

*** agenda
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c a") 'org-agenda)
(setq org-agenda-files (concat os-directory ".agenda_files"))
(fset 'my-agenda-view
   [?\C-c ?a ?n ?\C-x ?0 ?\C-x ?3 ?\C-x ?o ?\C-x ?b return])
(global-set-key (kbd "C-c A") 'my-agenda-view)
(fset 'my-todo-view
   [?\C-c ?a ?T return])
(global-set-key (kbd "C-c T") 'my-todo-view)
#+END_SRC

*** emphasized text
#+BEGIN_SRC emacs-lisp
(setq org-hide-emphasis-markers t)
#+END_SRC
*** ellipsis
#+BEGIN_SRC emacs-lisp
(setq org-ellipsis "▾")
#+END_SRC
** org-bullets
#+BEGIN_SRC emacs-lisp
(require 'org-bullets)
(add-hook 'org-mode-hook 'org-bullets-mode)
(setq org-bullets-bullet-list (quote ("→")))
#+END_SRC
** publish HTML
#+BEGIN_SRC emacs-lisp
(require 'htmlize)

(global-set-key (kbd "C-c P") (lambda () "" (interactive) (org-publish-all t)))
(setq org-publish-project-alist
      '(
	("orgsite-html"
	 :base-directory (org-directory)
	 :base-extension "org"
	 ;;	 :publishing-directory "~/Documents/orgsite/"
	 :publishing-directory "/run/user/1000/gvfs/smb-share:server=warehouse14.local,share=e_drive/_Working Cole/org/"
	 :recursive nil
	 :publishing-function org-html-publish-to-html
	 :headline-levels 4             ; Just the default for this project.
	 :auto-preamble t
	 :auto-sitemap t
	 :sitemap-sort-folders ignore)))
#+END_SRC
*** export on save
#+begin_src emacs-lisp
(defun toggle-org-publish-on-save ()
  (interactive)
  (if (memq 'org-publish-all after-save-hook)
      (progn
        (remove-hook 'after-save-hook 'org-publish-all t)
        (message "Disabled org publish on save for current buffer..."))
    (add-hook 'after-save-hook 'org-publish-all nil t)
    (message "Enabled org publish on save for current buffer...")))
(global-set-key (kbd "C-c p") 'toggle-org-publish-on-save)
#+end_src
** org-journal



For Emacs 24, download org-journal version 1.13.1 from
https://github.com/bastibe/org-journal/releases
#+BEGIN_SRC emacs-lisp
(require 'org-journal)
(global-set-key (kbd "C-c j") 'org-journal-new-entry)
(global-set-key (kbd "C-c J") (lambda () "" (interactive) (org-journal-new-entry " ") (beginning-of-buffer) (message "Displaying journal...")))
(setq org-journal-dir (concat home-directory "/Dropbox/journal")) ;; needed in customize
(setq org-journal-file-format "%Y%m%d.org")
#+END_SRC

** org-protocol
#+begin_src emacs-lisp
(require 'org-protocol)
(add-to-list 'load-path (concat user-emacs-directory "elpa/org-9.2.5/org-protocol.el"))
(server-start)
#+end_src

** mind mapping
#+BEGIN_SRC emacs-lisp
(require 'ox-org)
(require 'cl) ;; this fixed export problem, not sure why     
(load (concat user-emacs-directory "elpa/org-mind-map-20180826.2340/org-mind-map.el"))
(org-mind-map-make-node-fn default "Makes a plain box node without double borders" nil "box")

(setq org-mind-map-node-formats (quote (("default" . org-mind-map-default-node))))
#+END_SRC

