.config/settings.org
* package archives
#+BEGIN_SRC emacs-lisp
(setq package-archives
   (quote
    (("gnu" . "http://elpa.gnu.org/packages/")
     ("melpa" . "http://melpa.milkbox.net/packages/"))))
#+END_SRC

* smartparens


#+BEGIN_SRC emacs-lisp 
(smartparens-global-mode t)
(show-smartparens-global-mode t)
(define-key smartparens-mode-map (kbd "C-S-<left>") 'sp-forward-barf-sexp)
(define-key smartparens-mode-map (kbd "C-S-<right>") 'sp-forward-slurp-sexp)
(setq sp-use-subword t)
#+END_SRC
** pairs
#+BEGIN_SRC emacs-lisp
(sp-local-pair '(emacs-lisp-mode lisp-interaction-mode) "'" nil :actions nil)
(sp-local-pair '(org-mode tex-mode) "$" "$")
(sp-local-pair '(org-mode tex-mode) "\\textit{" "}" :insert "C-S-i")
(sp-local-pair '(org-mode tex-mode) "\\textbf{" "}" :insert "C-S-b")
;;(sp-local-pair '(org-mode tex-mode) "\\left(" "\\right)" :insert "C-c l")
;;(sp-local-pair '(org-mode tex-mode) "\\left[" "\\right]" :insert "C-c L")
(sp-local-pair '(java-mode) "System.out.println(" ")" :trigger "syso")
#+END_SRC
* word wrap
#+BEGIN_SRC emacs-lisp
(toggle-word-wrap)
(add-hook 'org-mode-hook 'visual-line-mode)
#+END_SRC
** visual fill column
#+BEGIN_SRC emacs-lisp
(require 'visual-fill-column)
(add-hook 'visual-line-mode-hook 'visual-fill-column-mode)
#+END_SRC
* shell buffer
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-!") 'shell)
#+END_SRC
* python
#+begin_src emacs-lisp
(elpy-enable)
#+end_src
** devel
#+begin_src emacs-lisp
(when (require 'flycheck nil t)
  (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
  (add-hook 'elpy-mode-hook 'flycheck-mode))

(require 'py-autopep8)
(add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save)

#+end_src
* magit
#+begin_src emacs-lisp
(global-set-key (kbd "C-x g") 'magit-status)
(global-set-key (kbd "C-x M-g") 'magit-dispatch)
#+end_src

* encryption
#+begin_src emacs-lisp
(require 'epa-file)
(epa-file-enable)
(setq org-tag-alist '(("crypt" . ?C)))
(fset 'my-org-crypt-tag
   [?\C-c ?\C-q ?C return])
#+end_src
* COMMENT use-package
#+begin_src emacs-lisp
(require 'use-package)
(use-package org
    :bind ("C-c d" . org-decrypt-entry)
    :bind ("C-c e" . my-org-crypt-tag)
    :init (org-crypt-use-before-save-magic)
    :custom
    (org-tags-exclude-from-inheritance (quote ("crypt")))
    (auto-save-default nil))
(setq org-crypt-key "F686C2025524DD00E3A074D53DADAAB8E7794AA7")
#+end_src

* whitespace clean
#+begin_src emacs-lisp
(global-set-key (kbd "C-c w") 'whitespace-cleanup)
#+end_src
* COMMENT rclone-sync
#+begin_src emacs-lisp
(defun my-rclone-sync () (interactive)
       (message "Syncing...") (shell-command "rclone sync ~/Dropbox emacsdb:")
       )
(global-set-key (kbd "C-c s") 'my-rclone-sync)
#+end_src

* COMMENT kill terminal
#+begin_src emacs-lisp
(global-set-key (kbd "C-x C-c") (lambda () (interactive) (my-rclone-sync) (save-buffers-kill-terminal)))
#+end_src



